#! bash -f
#----------------------------------------------------------------------------
#  Nightly ビルド処理 nightlybuild.sh
#	複数のブランチをビルドしたいのならここに追加する
#	(TwlSDK.sh 内の for 文にもタグ名を追加する必要があることに注意)
#----------------------------------------------------------------------------
ROOT=`dirname $0`
source $ROOT/../etc/spec.sh

#----------------------------------------------------------------------------
# HEAD
#
$ROOT/twl_wrapsdk.sh    nightlybuild HEAD

#----------------------------------------------------------------------------
